In [2]:
import pandas
import sqlite3

In [5]:
%%!
pip install --trusted-host pypi.org ipython-sql

['Collecting ipython-sql',
 '  Downloading https://files.pythonhosted.org/packages/ab/df/427e7cf05ffc67e78672ad57dce2436c1e825129033effe6fcaf804d0c60/ipython_sql-0.3.9-py2.py3-none-any.whl',
 'Requirement already satisfied: six in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython-sql) (1.12.0)',
 'Collecting prettytable (from ipython-sql)',
 '  Downloading https://files.pythonhosted.org/packages/ef/30/4b0746848746ed5941f052479e7c23d2b56d174b82f4fd34a25e389831f5/prettytable-0.7.2.tar.bz2',
 'Requirement already satisfied: sqlalchemy>=0.6.7 in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython-sql) (1.2.15)',
 'Requirement already satisfied: ipython-genutils>=0.1.0 in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython-sql) (0.2.0)',
 'Requirement already satisfied: ipython>=1.0 in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython-sql) (7.2.0)',
 'Collecting sqlparse (from ipython-sql)',
 '  Downloading https://files.pythonhosted.org/packages/65/85/20bdd72f4537cf2c4d5d005368d502b2f464ede22982e724a82c86268eda/sqlparse-0.2.4-py2.py3-none-any.whl',
 'Requirement already satisfied: decorator in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (4.3.0)',
 'Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (2.0.7)',
 'Requirement already satisfied: pickleshare in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)',
 'Requirement already satisfied: traitlets>=4.2 in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (4.3.2)',
 'Requirement already satisfied: pygments in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (2.3.1)',
 'Requirement already satisfied: colorama; sys_platform == "win32" in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.4.1)',
 'Requirement already satisfied: jedi>=0.10 in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.13.2)',
 'Requirement already satisfied: setuptools>=18.5 in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (40.6.3)',
 'Requirement already satisfied: backcall in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.1.0)',
 'Requirement already satisfied: wcwidth in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.7)',
 'Requirement already satisfied: parso>=0.3.0 in c:\\users\\rameshsrujana\\anaconda3\\lib\\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.3.1)',
 'Building wheels for collected packages: prettytable',
 '  Running setup.py bdist_wheel for prettytable: started',
 "  Running setup.py bdist_wheel for prettytable: finished with status 'done'",
 '  Stored in directory: C:\\Users\\rameshsrujana\\AppData\\Local\\pip\\Cache\\wheels\\80\\34\\1c\\3967380d9676d162cb59513bd9dc862d0584e045a162095606',
 'Successfully built prettytable',
 'Installing collected packages: prettytable, sqlparse, ipython-sql',
 'Successfully installed ipython-sql-0.3.9 prettytable-0.7.2 sqlparse-0.2.4']

In [6]:
%load_ext sql

In [7]:
%sql sqlite://

'Connected: @None'

In [8]:
%%sql
CREATE TABLE Order_Detail (
    invoice_id INTEGER NOT NULL,
    invoice_line INTEGER NOT NULL,
    store_id INTEGER NOT NULL,
    time_stamp DATE NOT NULL,
    product VARCHAR(8) NOT NULL,
    units INTEGER NOT NULL,
    sales NUMERIC(7 , 2 ) NOT NULL,
    cogs NUMERIC(5 , 2 ) NOT NULL
);

 * sqlite://
Done.

[]

In [12]:
%%sql
INSERT INTO Order_Detail(invoice_id,invoice_line,store_id,time_stamp,product,units,sales,cogs) VALUES (10000001,31215,3,'2017/09/03','3000',1,99.99,58.00);
INSERT INTO Order_Detail(invoice_id,invoice_line,store_id,time_stamp,product,units,sales,cogs) VALUES (10000001,31216,3,'2017/09/03','3354H',3,32.99,18.00);
INSERT INTO Order_Detail(invoice_id,invoice_line,store_id,time_stamp,product,units,sales,cogs) VALUES (10000002,91455,1,'2017/09/05','1234',2,24.99,20.00);
INSERT INTO Order_Detail(invoice_id,invoice_line,store_id,time_stamp,product,units,sales,cogs) VALUES (10000003,59943,2,'2017/09/05','3000',1,19.99,14.99);
INSERT INTO Order_Detail(invoice_id,invoice_line,store_id,time_stamp,product,units,sales,cogs) VALUES (10000004,95027,2,'2017/09/05','18518',1,9.99,3.00);
INSERT INTO Order_Detail(invoice_id,invoice_line,store_id,time_stamp,product,units,sales,cogs) VALUES (10000005,73994,2,'2017/09/10','12HA12',15,3.99,1.99);
INSERT INTO Order_Detail(invoice_id,invoice_line,store_id,time_stamp,product,units,sales,cogs) VALUES (10000006,98464,1,'2017/10/01','wh30000',1,199.99,75.00);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%%sql
select * from Order_Detail

 * sqlite://
Done.

[(10000001, 31215, 3, '2017/09/03', '3000', 1, 99.99, 58),
 (10000001, 31216, 3, '2017/09/03', '3354H', 3, 32.99, 18),
 (10000002, 91455, 1, '2017/09/05', '1234', 2, 24.99, 20),
 (10000003, 59943, 2, '2017/09/05', '3000', 1, 19.99, 14.99),
 (10000004, 95027, 2, '2017/09/05', '18518', 1, 9.99, 3),
 (10000005, 73994, 2, '2017/09/10', '12HA12', 15, 3.99, 1.99),
 (10000006, 98464, 1, '2017/10/01', 'wh30000', 1, 199.99, 75)]

In [15]:
%%sql
CREATE TABLE Product_Detail (
    product VARCHAR(8) NOT NULL,
    cat_name VARCHAR(8) NOT NULL,
    key_interal VARCHAR(8) NOT NULL
);

INSERT INTO Product_Detail(product,cat_name,key_interal) VALUES ('3000','WidgetA','17375273');
INSERT INTO Product_Detail(product,cat_name,key_interal) VALUES ('3354H','WidgetB','15477787');
INSERT INTO Product_Detail(product,cat_name,key_interal) VALUES ('1234','WidgetC','97845235');
INSERT INTO Product_Detail(product,cat_name,key_interal) VALUES ('18518','WidgetD','47813334');
INSERT INTO Product_Detail(product,cat_name,key_interal) VALUES ('12HA12','WidgetD','48573988');
INSERT INTO Product_Detail(product,cat_name,key_interal) VALUES ('wh30000','WidgetE','00000000');

select * from Product_Detail

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[('3000', 'WidgetA', '17375273'),
 ('3354H', 'WidgetB', '15477787'),
 ('1234', 'WidgetC', '97845235'),
 ('18518', 'WidgetD', '47813334'),
 ('12HA12', 'WidgetD', '48573988'),
 ('wh30000', 'WidgetE', '00000000')]

In [46]:
%%sql
SELECT SUM(SALES) AS Total_Sales,SUM(UNITS) AS Total_Quantity_Sold,SUM(SALES)-SUM(COGS) as Total_Profit, 
 datetime.date(TIME_STAMP).strftime("%V") AS Week_Number
FROM Order_Detail A, Product_Detail B where A.PRODUCT = B.PRODUCT datetime.date(TIME_STAMP).strf("%V")
LIMIT 20

 * sqlite://
(sqlite3.OperationalError) near "(": syntax error [SQL: 'SELECT SUM(SALES) AS Total_Sales,SUM(UNITS) AS Total_Quantity_Sold,SUM(SALES)-SUM(COGS) as Total_Profit, \n datetime.date(TIME_STAMP).strftime("%V") AS Week_Number\nFROM Order_Detail A, Product_Detail B where A.PRODUCT = B.PRODUCT datetime.date(TIME_STAMP).strf("%V")\nLIMIT 20'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [47]:
%%sql
select sum(sales) from Order_Detail

 * sqlite://
Done.

[(391.93000000000006,)]

In [27]:
%%sql
SELECT SUM(SALES) AS Total_Sales,SUM(UNITS) AS Total_Quantity_Sold,SUM(SALES)-SUM(COGS) as Total_Profit 
FROM Order_Detail A, Product_Detail B where A.PRODUCT = B.PRODUCT group by sales

 * sqlite://
Done.

[(3.99, 15, 2.0),
 (9.99, 1, 6.99),
 (19.99, 1, 4.999999999999998),
 (24.99, 2, 4.989999999999998),
 (32.99, 3, 14.990000000000002),
 (99.99, 1, 41.989999999999995),
 (199.99, 1, 124.99000000000001)]

In [51]:
import sqlite3
connection=sqlite3.connect("srujana.db")

In [29]:
crsr=connection.cursor()

In [30]:
sql_command="""CREATE TABLE emp (  
staff_number INTEGER PRIMARY KEY,  
fname VARCHAR(20),  
lname VARCHAR(30),  
gender CHAR(1),  
joining DATE);"""

In [31]:
crsr.execute(sql_command)

In [32]:
sql_command = """INSERT INTO emp VALUES (23, "Rishabh", "Bansal", "M", "2014-03-28");"""
crsr.execute(sql_command)

In [33]:
sql_command = """INSERT INTO emp VALUES (1, "Bill", "Gates", "M", "1980-10-28");"""
crsr.execute(sql_command)

In [34]:
connection.commit()

In [49]:
sql_command="""select * from emp;"""
print("fetchall:")

fetchall:

In [40]:
crsr.execute(sql_command)